FKDD_COPY_DIFF_3_2026-02-14/Documents/БТ_ЗаработнаяПлатаПоФормеП4.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>БТ_ЗаработнаяПлатаПоФормеП4</Name>
			<Comment>Заработная плата по форме П4</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЗП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеПоЗаработнойПлате</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отдел</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БТ_Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетнаяБаза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВыплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/БТ_ЗаработнаяПлатаПоФормеП4/Ext/ObjectModule.bsl
Функция ДокументУникален()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БТ_ЗаработнаяПлатаПоФормеП4.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.БТ_ЗаработнаяПлатаПоФормеП4 КАК БТ_ЗаработнаяПлатаПоФормеП4
	|ГДЕ
	|	БТ_ЗаработнаяПлатаПоФормеП4.Ссылка <> &Ссылка
	|	И БТ_ЗаработнаяПлатаПоФормеП4.Подразделение = &Подразделение
	|	И БТ_ЗаработнаяПлатаПоФормеП4.ПериодЗП = &ПериодЗП
	|	И БТ_ЗаработнаяПлатаПоФормеП4.Проведен";
	
	Запрос.УстановитьПараметр("ПериодЗП", ПериодЗП);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Ложь;
	КонецЦикла;
	Возврат Истина;
КонецФункции
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Проведен и НЕ ДокументУникален() Тогда       
		Сообщить("По подразделению " + Подразделение + " за период " + МесяцСтрокойЗаглавная(ПериодЗП,КонецМесяца(ПериодЗП)) + " документ уже заведен.");
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры
Функция МесяцСтрокойЗаглавная(НачДата,КонДата)Экспорт
	Если НачалоДня(НачДата)=НачалоМесяца(НачДата) и
		КонецДня(КонДата)=КонецМесяца(КонДата) Тогда
		МесяцСтрока=Формат(НачДата,"ДЛФ=DD");
		МесяцСтрока=Сред(МесяцСтрока,3);
		МесяцСтрока=СтрЗаменить(МесяцСтрока,"мая","май");
		МесяцСтрока=СтрЗаменить(МесяцСтрока,"я ","ь ");
		МесяцСтрока=СтрЗаменить(МесяцСтрока,"а "," ");
		Возврат СтрЗаменить(Трег(СокрЛП(МесяцСтрока)),"Г.","г.");
	Иначе
		Возврат Формат(НачДата,"ДФ=dd.MM.yy")+"-"+Формат(КонДата,"ДФ=dd.MM.yy");
	КонецЕсли;
КонецФункции
